Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.80/PIC32CM-JH01/edc/PIC32CM5164JH01064.PIC
      <edc:SFRDef edc:_addr="0x42005014" edc:access="-------n" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Debug Run" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42005015" edc:offset="0x7EB"/>
      <edc:SFRDef edc:_addr="0x42005800" edc:access="-n----nn" edc:cname="CTRL" edc:impl="0x43" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="CCL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CCL">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="The peripheral is not reset" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The peripheral is reset" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="The peripheral is disabled" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The peripheral is enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Generic clock is not required in standby sleep mode" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="Generic clock is  required in standby sleep mode" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42005801" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x42005804" edc:access="----nnnn" edc:cname="SEQCTRL0" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="CCL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CCL">
            <edc:SFRFieldDef edc:cname="SEQSEL" edc:desc="Sequential Selection" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Sequential logic is disabled" edc:when="(field &amp; 0xF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DFF" edc:desc="D flip flop" edc:when="(field &amp; 0xF) == 1"/>
              <edc:SFRFieldSemantic edc:cname="JK" edc:desc="JK flip flop" edc:when="(field &amp; 0xF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="LATCH" edc:desc="D latch" edc:when="(field &amp; 0xF) == 3"/>
              <edc:SFRFieldSemantic edc:cname="RS" edc:desc="RS latch" edc:when="(field &amp; 0xF) == 4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42005805" edc:access="----nnnn" edc:cname="SEQCTRL1" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="CCL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CCL">
            <edc:SFRFieldDef edc:cname="SEQSEL" edc:desc="Sequential Selection" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Sequential logic is disabled" edc:when="(field &amp; 0xF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DFF" edc:desc="D flip flop" edc:when="(field &amp; 0xF) == 1"/>
              <edc:SFRFieldSemantic edc:cname="JK" edc:desc="JK flip flop" edc:when="(field &amp; 0xF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="LATCH" edc:desc="D latch" edc:when="(field &amp; 0xF) == 3"/>
              <edc:SFRFieldSemantic edc:cname="RS" edc:desc="RS latch" edc:when="(field &amp; 0xF) == 4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42005806" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x42005808" edc:access="nnnnnnnn-nnnnnnnnnnnnnnnn-nn--n-" edc:cname="LUTCTRL0" edc:impl="0xFF7FFFB2" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CCL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CCL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="LUT Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="LUT block is disabled" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="LUT block is enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FILTSEL" edc:desc="Filter Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Filter disabled" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SYNCH" edc:desc="Synchronizer enabled" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FILTER" edc:desc="Filter enabled" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EDGESEL" edc:desc="Edge Selection" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Edge detector is disabled" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="Edge detector is enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="INSEL0" edc:desc="Input Selection 0" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="MASK" edc:desc="Masked input" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FEEDBACK" edc:desc="Feedback input source" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="LINK" edc:desc="Linked LUT input source" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="EVENT" edc:desc="Event input source" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="IO" edc:desc="I/O pin input source" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="AC" edc:desc="AC input source" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="TC" edc:desc="TC input source" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="ALTTC" edc:desc="Alternate TC input source" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="TCC" edc:desc="TCC input source" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM" edc:desc="SERCOM input source" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="ALT2TC" edc:desc="Second alternative TC input source" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="ASYNCEVENT" edc:desc="Asynchronous event input source" edc:when="(field &amp; 0xF) == 0xB"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="INSEL1" edc:desc="Input Selection 1" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="MASK" edc:desc="Masked input" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FEEDBACK" edc:desc="Feedback input source" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="LINK" edc:desc="Linked LUT input source" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="EVENT" edc:desc="Event input source" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="IO" edc:desc="I/O pin input source" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="AC" edc:desc="AC input source" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="TC" edc:desc="TC input source" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="ALTTC" edc:desc="Alternate TC input source" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="TCC" edc:desc="TCC input source" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM" edc:desc="SERCOM input source" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="ALT2TC" edc:desc="Second alternative TC input source" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="ASYNCEVENT" edc:desc="Asynchronous event input source" edc:when="(field &amp; 0xF) == 0xB"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="INSEL2" edc:desc="Input Selection 2" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="MASK" edc:desc="Masked input" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FEEDBACK" edc:desc="Feedback input source" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="LINK" edc:desc="Linked LUT input source" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="EVENT" edc:desc="Event input source" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="IO" edc:desc="I/O pin input source" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="AC" edc:desc="AC input source" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="TC" edc:desc="TC input source" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="ALTTC" edc:desc="Alternate TC input source" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="TCC" edc:desc="TCC input source" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM" edc:desc="SERCOM input source" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="ALT2TC" edc:desc="Second alternative TC input source" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="ASYNCEVENT" edc:desc="Asynchronous event input source" edc:when="(field &amp; 0xF) == 0xB"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="INVEI" edc:desc="Inverted Event Input Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Incoming event is not inverted" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="INVERTED" edc:desc="Incoming event is inverted" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LUTEI" edc:desc="LUT Event Input Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="LUT incoming event is disabled" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="LUT incoming event is enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LUTEO" edc:desc="LUT Event Output Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="LUT event output is disabled" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="LUT event output is enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TRUTH" edc:desc="Truth Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200580C" edc:access="nnnnnnnn-nnnnnnnnnnnnnnnn-nn--n-" edc:cname="LUTCTRL1" edc:impl="0xFF7FFFB2" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CCL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CCL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="LUT Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="LUT block is disabled" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="LUT block is enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FILTSEL" edc:desc="Filter Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Filter disabled" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SYNCH" edc:desc="Synchronizer enabled" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FILTER" edc:desc="Filter enabled" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EDGESEL" edc:desc="Edge Selection" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Edge detector is disabled" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="Edge detector is enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="INSEL0" edc:desc="Input Selection 0" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="MASK" edc:desc="Masked input" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FEEDBACK" edc:desc="Feedback input source" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="LINK" edc:desc="Linked LUT input source" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="EVENT" edc:desc="Event input source" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="IO" edc:desc="I/O pin input source" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="AC" edc:desc="AC input source" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="TC" edc:desc="TC input source" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="ALTTC" edc:desc="Alternate TC input source" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="TCC" edc:desc="TCC input source" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM" edc:desc="SERCOM input source" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="ALT2TC" edc:desc="Second alternative TC input source" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="ASYNCEVENT" edc:desc="Asynchronous event input source" edc:when="(field &amp; 0xF) == 0xB"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="INSEL1" edc:desc="Input Selection 1" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="MASK" edc:desc="Masked input" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FEEDBACK" edc:desc="Feedback input source" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="LINK" edc:desc="Linked LUT input source" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="EVENT" edc:desc="Event input source" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="IO" edc:desc="I/O pin input source" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="AC" edc:desc="AC input source" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="TC" edc:desc="TC input source" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="ALTTC" edc:desc="Alternate TC input source" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="TCC" edc:desc="TCC input source" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM" edc:desc="SERCOM input source" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="ALT2TC" edc:desc="Second alternative TC input source" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="ASYNCEVENT" edc:desc="Asynchronous event input source" edc:when="(field &amp; 0xF) == 0xB"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="INSEL2" edc:desc="Input Selection 2" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="MASK" edc:desc="Masked input" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FEEDBACK" edc:desc="Feedback input source" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="LINK" edc:desc="Linked LUT input source" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="EVENT" edc:desc="Event input source" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="IO" edc:desc="I/O pin input source" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="AC" edc:desc="AC input source" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="TC" edc:desc="TC input source" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="ALTTC" edc:desc="Alternate TC input source" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="TCC" edc:desc="TCC input source" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM" edc:desc="SERCOM input source" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="ALT2TC" edc:desc="Second alternative TC input source" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="ASYNCEVENT" edc:desc="Asynchronous event input source" edc:when="(field &amp; 0xF) == 0xB"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="INVEI" edc:desc="Inverted Event Input Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Incoming event is not inverted" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="INVERTED" edc:desc="Incoming event is inverted" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LUTEI" edc:desc="LUT Event Input Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="LUT incoming event is disabled" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="LUT incoming event is enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LUTEO" edc:desc="LUT Event Output Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="LUT event output is disabled" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="LUT event output is enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TRUTH" edc:desc="Truth Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
